18piyush/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
	if (ts->pipe_idle_us > ts->pipe_busy_us) {
		limiter = "host out of pkts";
		limiter_cnt = stops;
	} else if (limiter_cnt == 0) {
		limiter = "RPU turnaround";
		limiter_cnt = stops;
	}

	shell_fprintf(sh, SHELL_INFO,
		      "TX: %u cmds, %u pkts, %u dones | %u.%02u pkts/cmd (cap %u), "
		      "%u B/cmd (%u%% of %u B cap), %u B/pkt\n",
		      ts->tx_cmds,
		      ts->tx_cmd_pkts,
		      ts->tx_dones,
		      avg_pkts_x100 / 100U,
		      avg_pkts_x100 % 100U,
		      sys_fpriv->data_config.max_tx_aggregation,
		      avg_bytes,
		      cap ? ((avg_bytes * 100U) / cap) : 0U,
		      cap,
		      ts->tx_cmd_pkts ?
			      (unsigned int)(ts->tx_cmd_data_bytes / ts->tx_cmd_pkts) : 0U);
	shell_fprintf(sh, SHELL_INFO,
		      "    tokens: %u of %u used, %u max in flight, %u busy, %u starved | "
		      "limiter: %s (%u%%)\n",
		      tokens_used,
		      sys_fpriv->num_tx_tokens,
		      max_in_flight,
		      busy,
		      starved,
		      limiter,
		      stops ? ((limiter_cnt * 100U) / stops) : 0U);
	if (ts->tx_cmds) {
		unsigned long long inflight_us = 0;
		unsigned long long busy_us = ts->pipe_busy_us;
		unsigned int window_us = ts->window_start_cyc ?
			k_cyc_to_us_floor32(k_cycle_get_32() - ts->window_start_cyc) : 0U;

		for (i = 0; i < NRF71_MAX_TX_TOKENS; i++) {
			inflight_us += ts->token_inflight_us[i];
		}

		/* Concurrency and rate are computed over the time the pipe was
		 * actually busy, so an idle period before the traffic started
		 * does not dilute them; busy%% is against the window since the
		 * counters were cleared, so clear right before a run.
		 */
		shell_fprintf(sh, SHELL_INFO,
			      "    turnaround: %u us/cmd, %u.%02u cmds in flight while busy "
			      "(max %u), %u KB/s in flight\n",
			      (unsigned int)(inflight_us / ts->tx_cmds),
			      busy_us ? (unsigned int)(inflight_us / busy_us) : 0U,
			      busy_us ? (unsigned int)((inflight_us * 100ULL / busy_us) % 100U) :
					0U,
			      ts->max_cmds_in_flight,
			      busy_us ? (unsigned int)((ts->tx_cmd_bytes * 1000ULL) / busy_us) :
					0U);
		shell_fprintf(sh, SHELL_INFO,
			      "    pipe: busy %llu ms, idle %llu ms, busy %u%% of the "
			      "%u ms window since clear\n",
			      ts->pipe_busy_us / 1000ULL,
			      ts->pipe_idle_us / 1000ULL,
			      window_us ? (unsigned int)((ts->pipe_busy_us * 100ULL) /
							 window_us) : 0U,
			      window_us / 1000U);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "    host: %u pkts in, %u held on pend_q (%u%%), drops: %u q_full, "
		      "%u other%s\n",
		      ts->if_send_calls,
		      ts->pkts_queued,
		      ts->if_send_accepted ?
			      ((ts->pkts_queued * 100U) / ts->if_send_accepted) : 0U,
		      q_full,
		      ts->if_drop_no_nbuf + ts->if_drop_unknown_peer + ts->if_drop_not_ready,
		      starved ? " | STARVED, see -v" : "");
}

static void tx_token_stats_dump(const struct shell *sh,
				struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx,
				struct nrf_wifi_sys_fmac_priv *sys_fpriv)
{
	struct tx_token_stats *ts = &sys_dev_ctx->tx_config.token_stats;
	unsigned int num_tx_tokens = sys_fpriv->num_tx_tokens;
	unsigned int num_tx_tokens_per_ac = sys_fpriv->num_tx_tokens_per_ac;
	unsigned int cap = sys_fpriv->avail_ampdu_len_per_token;
	unsigned int max_aggr = sys_fpriv->data_config.max_tx_aggregation;
	unsigned int total_gets = 0;
	unsigned int total_busy = 0;
	unsigned int total_starved = 0;
	unsigned int aggr_stops;
	unsigned int i;

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Per-token efficiency ---\n"
		      "tokens: %u (reserved/AC: %u, spare: %u), "
		      "caps: %u B/token, %u pkts/token\n",
		      num_tx_tokens,
		      num_tx_tokens_per_ac,
		      num_tx_tokens - (num_tx_tokens_per_ac * NRF_WIFI_FMAC_AC_MAX),
		      cap,
		      max_aggr);
	shell_fprintf(sh, SHELL_INFO,
		      "bytes = packet data + %u B headroom per packet, i.e. what is\n"
		      "budgeted against the per-token size cap; acq = times the token was\n"
		      "taken from the free pool (a busy token is re-used in TX done and is\n"
		      "not returned, so acq stays low while cmds keeps rising)\n",
		      TX_BUF_HEADROOM);

	shell_fprintf(sh, SHELL_INFO,
		      "%-4s %6s %8s %9s %8s %9s %5s %8s %9s %8s %8s %6s %s\n",
		      "tok", "acq", "cmds", "pkts", "pkts/cmd", "bytes/cmd",
		      "fill", "max_pkts", "max_bytes", "us/cmd", "max_us", "KB/s",
		      "type");

	for (i = 0; i < num_tx_tokens && i < NRF71_MAX_TX_TOKENS; i++) {
		unsigned int cmds = ts->token_cmds[i];
		unsigned int pkts_x100 = cmds ? ((ts->token_pkts[i] * 100U) / cmds) : 0U;
		unsigned int bytes_per_cmd = cmds ?
			(unsigned int)(ts->token_bytes[i] / cmds) : 0U;
		bool spare = (i >= (num_tx_tokens_per_ac * NRF_WIFI_FMAC_AC_MAX));

		unsigned int us_per_cmd = cmds ?
			(unsigned int)(ts->token_inflight_us[i] / cmds) : 0U;

		shell_fprintf(sh, SHELL_INFO,
			      "%-4u %6u %8u %9u %5u.%02u %9u %4u%% %8u %9u %8u %8u %6u %s\n",
			      i,
			      ts->token_acq[i],
			      cmds,
			      ts->token_pkts[i],
			      pkts_x100 / 100U,
			      pkts_x100 % 100U,
			      bytes_per_cmd,
			      cap ? ((bytes_per_cmd * 100U) / cap) : 0U,
			      ts->token_max_pkts[i],
			      ts->token_max_bytes[i],
			      us_per_cmd,
			      ts->token_max_inflight_us[i],
			      ts->token_inflight_us[i] ?
				      (unsigned int)((ts->token_bytes[i] * 1000ULL) /
						     ts->token_inflight_us[i]) : 0U,
			      spare ? "spare" : ac_str(i % NRF_WIFI_FMAC_AC_MAX));
	}

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Aggregation: packets per TX command ---\n");

	for (i = 0; i < MAX_TX_AGG_SIZE; i++) {
		if (ts->pkts_per_cmd[i] == 0) {
			continue;
		}

		shell_fprintf(sh, SHELL_INFO,
			      "%2u pkt(s) - %u cmd(s) (%u.%02u%%)\n",
			      i + 1,
			      ts->pkts_per_cmd[i],
			      ts->tx_cmds ?
				      ((ts->pkts_per_cmd[i] * 100U) / ts->tx_cmds) : 0U,
			      ts->tx_cmds ?
				      (((ts->pkts_per_cmd[i] * 10000U) / ts->tx_cmds) % 100U) :
				      0U);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Aggregation: token fill level (%% of %u B cap) ---\n",
		      cap);

