18piyush/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
static int nrf_wifi_util_heap(const struct shell *sh, size_t argc, char **argv)
{
	struct k_heap *ctrl_pool;
	struct k_heap *data_pool;
	struct sys_memory_stats stats;
	int err;

	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_mem_get_heaps(&ctrl_pool, &data_pool);

	err = sys_heap_runtime_stats_get(&ctrl_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read control heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Control pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	err = sys_heap_runtime_stats_get(&data_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read data heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Data pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	return 0;
}

static void nrf_wifi_util_dump_mac_addr_slots(const struct shell *sh, bool uicr)
{
	const char *block = uicr ? "UICR" : "FICR";

	for (unsigned char slot = 0; slot < NRF_WIFI_XICR_MAC_ADDR_SLOTS; slot++) {
		uint32_t low, high;
		int ret;

		ret = nrf_wifi_xicr_mac_addr_slot_read(uicr, slot, &low, &high);
		if (ret == -ENOTSUP) {
			shell_print(sh, "%s: not accessible", block);
			return;
		} else if (ret) {
			shell_error(sh, "%s MACADDR[%u]: read failed (err %d)",
				    block, slot, ret);
			continue;
		}

		shell_print(sh, "%s MACADDR[%u].LOW  = 0x%08X", block, slot, low);
		shell_print(sh, "%s MACADDR[%u].HIGH = 0x%08X", block, slot, high);

		if (nrf_wifi_mac_addr_regs_empty(low, high)) {
			shell_print(sh, "%s MACADDR[%u]      = not programmed",
				    block, slot);
			continue;
		}

		/* HIGH holds bits [47:24] of the address, LOW bits [23:0], both
		 * MSB first, so 00F4CE36 / 00112233 is F4:CE:36:11:22:33.
		 */
		shell_print(sh, "%s MACADDR[%u]      = %02X:%02X:%02X:%02X:%02X:%02X",
			    block, slot,
			    (uint8_t)(high >> 16), (uint8_t)(high >> 8), (uint8_t)high,
			    (uint8_t)(low >> 16), (uint8_t)(low >> 8), (uint8_t)low);
	}
}

static int nrf_wifi_util_mac_addr(const struct shell *sh, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_util_dump_mac_addr_slots(sh, true);
	nrf_wifi_util_dump_mac_addr_slots(sh, false);

	for (unsigned char vif_idx = 0; vif_idx < MAX_NUM_VIFS; vif_idx++) {
		uint8_t mac_addr[WIFI_MAC_ADDR_LEN];
		int ret;

		ret = nrf_wifi_xicr_mac_addr_get(vif_idx, mac_addr, NULL);
		if (ret) {
			shell_error(sh, "VIF%u: no MAC address available (err %d)",
				    vif_idx, ret);
			continue;
		}

		shell_print(sh, "VIF%u resolved    = %02X:%02X:%02X:%02X:%02X:%02X",
			    vif_idx,
			    mac_addr[0], mac_addr[1], mac_addr[2],
			    mac_addr[3], mac_addr[4], mac_addr[5]);
	}

	return 0;
}

/* Parses a single "<key>=<value>" unsigned integer parameter from the
 * supplied segment and stores it in *out when present. The look-up is bounded
 * to the current peer's segment by the caller (the buffer is temporarily NUL
 * terminated at the next peer boundary), so parameters of the following peer
 * are never picked up by mistake.
 */
static void ftm_parse_uint(const char *seg, const char *key, unsigned long *out)
{
	const char *tok = strstr(seg, key);

	if (tok) {
		sscanf(tok + strlen(key), "%lu", out);
	}
}

/* Parses a "<key>=<hexstring>" token (e.g. "protocol=6c0000") and converts the
 * hex string into raw bytes stored in out[]. Returns the number of bytes
 * written, 0 if the key is absent, or -1 on a malformed hex value.
 */
static int util_parse_hex(const char *buf,
			  const char *key,
			  unsigned char *out,
			  unsigned int out_sz)
{
	const char *tok = strstr(buf, key);
	char hex_str[64];

	if (!tok) {
		return 0;
	}

	if (sscanf(tok + strlen(key), "%63s", hex_str) != 1) {
		return -1;
	}

	return nrf_wifi_utils_hex_str_to_val(out,
					     out_sz,
					     (unsigned char *)hex_str);
}

static int nrf_wifi_util_ftm_start(const struct shell *sh,
				   size_t argc,
				   char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_umac_cmd_meas_start ftm_cmd;
	char conf_buf[256];
	char *seg = NULL;
	char *tok_s = NULL;
	unsigned long val = 0;
	size_t off = 0;
	unsigned int i = 0;
	int ret = 0;

	memset(&ftm_cmd, 0, sizeof(ftm_cmd));

	/* The FTM parameters are passed as "<key>=<value>" tokens. Re-assemble
	 * them into a single buffer so they can be parsed regardless of order.
	 * Tip: pass the whole parameter list as one quoted argument to avoid the
	 * shell's argument count limit (CONFIG_SHELL_ARGC_MAX).
	 */
	for (i = 1; i < argc; i++) {
		int n = snprintf(conf_buf + off,
				 sizeof(conf_buf) - off,
				 "%s%s",
				 (off ? " " : ""),
				 argv[i]);

		if ((n < 0) || ((size_t)n >= sizeof(conf_buf) - off)) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "FTM parameters too long\n");
			return -ENOEXEC;
		}
		off += n;
	}

	tok_s = strstr(conf_buf, "num_of_peers=");
	if (!tok_s) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "num_of_peers is mandatory\n");
		shell_help(sh);
		return -ENOEXEC;
	}
	sscanf(tok_s + strlen("num_of_peers="), "%lu", &val);
	ftm_cmd.info.n_peers = val;

	if ((ftm_cmd.info.n_peers == 0) ||
	    (ftm_cmd.info.n_peers > MAX_NUM_PEERS)) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid num_of_peers %u (valid: 1 - %d)\n",
			      ftm_cmd.info.n_peers,
			      MAX_NUM_PEERS);
		return -ENOEXEC;
	}

	seg = conf_buf;
	for (i = 0; i < ftm_cmd.info.n_peers; i++) {
		struct nrf_wifi_umac_meas_request *req = &ftm_cmd.info.meas_req[i];
		unsigned int mac[NRF_WIFI_ETH_ADDR_LEN];
		char *seg_end = NULL;
		char saved = '\0';
		unsigned int j = 0;

		tok_s = strstr(seg, "mac_addr=");
		if (!tok_s) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "mac_addr missing for peer %u\n",
				      i);
			return -ENOEXEC;
		}

		if (sscanf(tok_s + strlen("mac_addr="),
			   "%x:%x:%x:%x:%x:%x",
			   &mac[0], &mac[1], &mac[2],
			   &mac[3], &mac[4], &mac[5]) != NRF_WIFI_ETH_ADDR_LEN) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "Invalid mac_addr for peer %u "
				      "(expected xx:xx:xx:xx:xx:xx)\n",
				      i);
			return -ENOEXEC;
		}

		for (j = 0; j < NRF_WIFI_ETH_ADDR_LEN; j++) {
			req->mac_addr[j] = (unsigned char)mac[j];
		}

		/* Bound the remaining look-ups to this peer's segment, which
		 * ends where the next peer's "mac_addr=" begins.
		 */
		seg_end = strstr(tok_s + strlen("mac_addr="), "mac_addr=");
		if (seg_end) {
			saved = *seg_end;
			*seg_end = '\0';
		}

		val = 0;
		ftm_parse_uint(tok_s, "band=", &val);
		req->band = (signed int)val;

		val = 0;
		ftm_parse_uint(tok_s, "center_freq=", &val);
		req->center_frequency = (unsigned int)val;

		val = 0;
		ftm_parse_uint(tok_s, "preamble=", &val);
		req->preamble = (signed int)val;

		val = 0;
		ftm_parse_uint(tok_s, "burst_period=", &val);
		req->burst_period = (unsigned char)val;

		val = 0;
		ftm_parse_uint(tok_s, "ftms_per_burst=", &val);
		req->ftms_per_burst = (unsigned char)val;

		val = 0;
		ftm_parse_uint(tok_s, "ftm_params=", &val);
		req->ftm_params = (unsigned char)val;

		val = 0;
		ftm_parse_uint(tok_s, "burst_duration=", &val);
		req->burst_duration = (unsigned char)val;

		val = 0;
		ftm_parse_uint(tok_s, "num_bursts_exp=", &val);
		req->num_bursts_exp = (unsigned char)val;

		val = 0;
		ftm_parse_uint(tok_s, "min_delta_ftm=", &val);
		req->min_delta_ftm = (unsigned char)val;

		val = 0;
		ftm_parse_uint(tok_s, "tsf_timer_value=", &val);
		req->tsf_timer_value = (unsigned short)val;

		val = 0;
		ftm_parse_uint(tok_s, "tsf_timer_disable=", &val);
		req->tsf_timer_disable = (unsigned char)val;

		if (seg_end) {
			*seg_end = saved;
			seg = seg_end;
		}
	}

	ftm_cmd.umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_MEAS_START;
	ftm_cmd.umac_hdr.ids.wdev_id = 0;
	ftm_cmd.umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}
	fmac_dev_ctx = ctx->rpu_ctx;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      &ftm_cmd,
			      sizeof(ftm_cmd));
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Failed to start FTM measurement\n");
		ret = -ENOEXEC;
		goto unlock;
	}

