18piyush/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
	shell_fprintf(sh,
		      SHELL_INFO,
		      "GAS ANQP query sent (token=%u, length=%u)\n",
		      gas_cmd->info.dialog_token,
		      gas_cmd->info.length);
	ret = 0;
unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}

SHELL_STATIC_SUBCMD_SET_CREATE(
	nrf71_util,
	SHELL_CMD_ARG(he_ltf,
		      NULL,
		      "0 - 1x HE LTF\n"
		      "1 - 2x HE LTF\n"
		      "2 - 4x HE LTF                                        ",
		      nrf_wifi_util_set_he_ltf,
		      2,
		      0),
	SHELL_CMD_ARG(he_gi,
		      NULL,
		      "0 - 0.8 us\n"
		      "1 - 1.6 us\n"
		      "2 - 3.2 us                                           ",
		      nrf_wifi_util_set_he_gi,
		      2,
		      0),
	SHELL_CMD_ARG(set_he_ltf_gi,
		      NULL,
		      "0 - Disable\n"
		      "1 - Enable",
		      nrf_wifi_util_set_he_ltf_gi,
		      2,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(uapsd_queue,
		      NULL,
		      "<val> - 0 to 15",
		      nrf_wifi_util_set_uapsd_queue,
		      2,
		      0),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(show_config,
		      NULL,
		      "Display the current configuration values",
		      nrf_wifi_util_show_cfg,
		      1,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(tx_stats,
		      NULL,
		      "Displays a TX statistics summary: aggregation, token usage\n"
		      "and what is limiting the TX path\n"
		      "Parameters:\n"
		      "    vif_index: 0 - 1\n"
		      "    -v       : (optional) full per-token, histogram and per-AC dump\n"
		      "    clear    : (optional) reset the TX token counters\n",
		      nrf_wifi_util_tx_stats,
		      2,
		      2),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(tx_rate,
		      NULL,
		      "Sets TX data rate to either a fixed value or AUTO\n"
		      "Parameters:\n"
		      "    <rate_flag> : The TX data rate type to be set, where:\n"
		      "        0 - LEGACY\n"
		      "        1 - HT\n"
		      "        2 - VHT\n"
		      "        3 - HE_SU\n"
		      "        4 - HE_ER_SU\n"
		      "        5 - AUTO\n"
		      "    <rate_val> : The TX data rate value to be set, valid values are:\n"
		      "        Legacy : <1, 2, 55, 11, 6, 9, 12, 18, 24, 36, 48, 54>\n"
		      "        Non-legacy: <MCS index value between 0 - 7>\n"
		      "        AUTO: <No value needed>\n",
		      nrf_wifi_util_tx_rate,
		      2,
		      1),
	SHELL_CMD_ARG(show_vers,
		      NULL,
		      "Display the driver and the firmware versions",
		      nrf_wifi_util_show_vers,
		      1,
		      0),
	SHELL_CMD_ARG(heap,
		      NULL,
		      "Control and data pool heap usage statistics",
		      nrf_wifi_util_heap,
		      1,
		      0),
#if !defined(CONFIG_NRF71_RADIO_TEST) && !defined(CONFIG_NRF71_OFFLOADED_RAW_TX)
	SHELL_CMD_ARG(rpu_stats,
		      NULL,
		      "Display RPU stats "
		      "Parameters: umac or lmac or phy or all (default)",
		      nrf_wifi_util_dump_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(clear_rpu_stats,
		      NULL,
		      "Clear RPU stats. Parameters: umac|lmac|phy|all (default)",
		      nrf_wifi_util_clear_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(debug_stats,
		      NULL,
		      "Request debug stats from RPU. Parameters: umac|lmac|phy",
		      nrf_wifi_util_debug_stats,
		      1,
		      1),
	SHELL_CMD_ARG(umac_int_stats,
		      NULL,
		      "Request UMAC internal (memory pool) stats from RPU",
		      nrf_wifi_util_umac_int_stats,
		      1,
		      0),
#endif /* !CONFIG_NRF71_RADIO_TEST && !CONFIG_NRF71_OFFLOADED_RAW_TX*/
#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
	SHELL_CMD_ARG(rpu_recovery_test,
		      NULL,
		      "Trigger RPU recovery",
		      nrf_wifi_util_trigger_rpu_recovery,
		      1,
		      0),
	SHELL_CMD_ARG(rpu_recovery_info,
		      NULL,
		      "Dump RPU recovery information",
		      nrf_wifi_util_rpu_recovery_info,
		      1,
		      0),
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */
	SHELL_CMD_ARG(mac_addr,
		      NULL,
		      "Dump the MAC addresses programmed in the xICR registers\n"
		      "and the address each interface resolves to",
		      nrf_wifi_util_mac_addr,
		      1,
		      0),
	SHELL_CMD_ARG(ftm_start,
		      NULL,
		      "Start an FTM (Fine Timing Measurement) ranging session.\n"
		      "Pass the parameters as a single quoted string of\n"
		      "\"<key>=<value>\" tokens (quoting avoids the shell argument\n"
		      "count limit).\n"
		      "Parameters:\n"
		      "    num_of_peers=<n>    : Number of peers (1 - 4) [mandatory]\n"
		      "  Per-peer (repeat the block below for each peer):\n"
		      "    mac_addr=<xx:xx:xx:xx:xx:xx> : Peer MAC address [mandatory]\n"
		      "    band=<n>            : Band the channel belongs to\n"
		      "    center_freq=<n>     : Center frequency in MHz\n"
		      "    preamble=<n>        : Preamble type (see nrf_wifi_preamble)\n"
		      "    burst_period=<n>    : Interval between FTM bursts\n"
		      "    ftms_per_burst=<n>  : FTM frames per burst\n"
		      "    ftm_params=<n>      : FTM parameter flags\n"
		      "    burst_duration=<n>  : Single burst measurement time\n"
		      "    num_bursts_exp=<n>  : Total number of bursts\n"
		      "    min_delta_ftm=<n>   : Minimum delta FTM\n"
		      "    tsf_timer_value=<n> : TSF timer value\n"
		      "    tsf_timer_disable=<n>: Enable(0)/disable(1) TSF timer\n"
		      "Example:\n"
		      "    wifi_util ftm_start \"num_of_peers=1 "
		      "mac_addr=00:11:22:33:44:55 band=0 center_freq=2412 "
		      "preamble=4 burst_period=10 ftms_per_burst=5\"\n",
		      nrf_wifi_util_ftm_start,
		      2,
		      20),
	SHELL_CMD_ARG(neighbor_req,
		      NULL,
		      "Send a Neighbor Report request (with LCI/CIVIC sub-elements).\n"
		      "Pass the parameters as a single quoted string of\n"
		      "\"<key>=<value>\" tokens (quoting avoids the shell argument\n"
		      "count limit).\n"
		      "Parameters:\n"
		      "    token=<n>                : Dialog token of the request\n"
		      "    sub_elems=<n>            : Sub-elements bitmap "
		      "(LCI_REQ=1, CIVIC_REQ=2)\n"
		      "    lci_mode=<n>             : LCI request mode\n"
		      "    lci_token=<n>            : LCI request token\n"
		      "    lci_sub=<n>              : LCI request subject\n"
		      "    civic_mode=<n>           : CIVIC request mode\n"
		      "    civic_token=<n>          : CIVIC request token\n"
		      "    civic_sub=<n>            : CIVIC request subject\n"
		      "    civic_loc_type=<n>       : CIVIC location type\n"
		      "    civic_interval_units=<n> : CIVIC interval units\n"
		      "    civic_interval=<n>       : CIVIC interval value\n"
		      "Example:\n"
		      "    wifi_util neighbor_req \"token=1 sub_elems=3 "
		      "lci_mode=0 lci_token=1 lci_sub=0 civic_mode=0 "
		      "civic_token=2 civic_sub=0\"\n",
		      nrf_wifi_util_neighbor_req,
		      2,
		      20),
	SHELL_CMD_ARG(gas_req,
		      NULL,
		      "Send a GAS ANQP query request.\n"
		      "Pass the parameters as a single quoted string of\n"
		      "\"<key>=<value>\" tokens (quoting avoids the shell argument\n"
		      "count limit).\n"
		      "Parameters:\n"
		      "    mac_addr=<xx:xx:xx:xx:xx:xx> : BSSID of the AP\n"
		      "    token=<n>      : Dialog token of the GAS query frame\n"
		      "    channel=<n>    : Channel to send the request on\n"
		      "    band=<n>       : Band the channel belongs to\n"
		      "    protocol=<hex> : Advertisement protocol IE (hex, up to "
		      "4 bytes, e.g. 6c0000)\n"
		      "    length=<n>     : Length of the query (optional; derived\n"
		      "                     from query_ids when omitted)\n"
		      "    query_ids=<hex>: ANQP query IDs as a hex string\n"
		      "Example:\n"
		      "    wifi_util gas_req \"mac_addr=00:11:22:33:44:55 token=1 "
		      "channel=1 band=0 protocol=6c query_ids=010c\"\n",
		      nrf_wifi_util_gas_req,
		      2,
		      20),
	SHELL_SUBCMD_SET_END);


SHELL_SUBCMD_ADD((nrf71), util, &nrf71_util, "nRF70 utility commands\n", NULL, 0, 0);


static int nrf_wifi_util_init(void)
{

	if (nrf_wifi_util_conf_init(&ctx->conf_params) < 0) {
		return -1;
	}

	return 0;
}


SYS_INIT(nrf_wifi_util_init,
	 APPLICATION,
	 CONFIG_APPLICATION_INIT_PRIORITY);
